# # Question 7
# 在m04.py中, 建立一個[傭金]類別
#     [1] 這家公司的員工負責銷售2種產品 (產品1及產品2), 以下是傭金計算方式:

#     [2] 產品1:
#         [2-1] 如果大於(含)300,000元, 有25%傭金率;
#         [2-2] 如果不到300,000元, 但是大於(含)200,000元, , 有20%傭金率;
#         [2-3] 如果不到200,000元, 但是大於(含)100,000元, , 有17%傭金率;
#         [2-4] 如果不到100,000元, 有12%傭金率.

#         例如:有員工的[產品1]銷售400,000元, 傭金 = 400,000元 * 0.25 = 100,000元

#     [3] 產品2:
#         [3-1] 如果大於(含)500,000元, 有35%傭金率;
#         [3-2] 如果不到500,000元, 有28%傭金率.

#         例如: 有員工的[產品2]銷售300,000元, 傭金 = 300,000元 * 0.28 = 84,000元

#     [4] 員工的傭金 = [產品1]的傭金 + [產品2]的傭金
#         例如: 上述員工的傭金 = 100,000元+ 84,000元 = 184,000元
# -------------------------------------------------------------------------------------
from m04 import Commission

commissions = []

# 編號, 產品1的銷售金額, 產品2的銷售金額
commissions.append(Commission(1, 300000, 500000))
commissions.append(Commission(2, 200000, 500000))
commissions.append(Commission(3, 100000, 500000))
commissions.append(Commission(4, 80000, 500000))
commissions.append(Commission(5, 300000, 300000))
commissions.append(Commission(6, 200000, 300000))
commissions.append(Commission(7, 100000, 300000))
commissions.append(Commission(8, 80000, 300000))

for c in commissions:
    print('編號:{}, 傭金:{:,.0f}元'.format(c.no, c.total()))
# -------------------------------------------------------------------------------------
