# # Question 2
# 輸入:  由鍵盤輸入一個字串
# 輸出: 字串的總累加分數
# 處理: (1) 輸入字串包括:
#          (1-1) '0' ~ '9' 的數字;
#          (1-2) 'A' ~ 'Z' 的大寫英文字;
#          (1-3) '+' ,  '-' ,  '*' ,  '/' (加減乘除)四種符號.
#          (1-4) 都是半型字, 請別打成全型字
#          (1-5) 假設測試輸入一定符合上述條件, 同學可以不必再檢查輸入字串是否符合條件.

#      (2) 輸入字串可以得到一個 [總累加分數] , 它由字串中的每個字代表之分數累加而成, 計算方法如下:
#          (2-1) 每一個數字, 可得1分;
#          (2-2) 每一個大寫英文字, 可得2分;
#          (2-3) 每一個 '+' (加號) , 可得5分;
#          (2-4) 每一個 '-'  (減號) , 可得5分;
#          (2-5) 每一個 '*' (乘號) , 可得10分;
#          (2-6) 每一個 '/' (除號) , 可得10分;
# Result
# 請輸入字串:0123
# 總累加分數:4

# 請輸入字串:0123+
# 總累加分數:9

# 請輸入字串:01++--
# 總累加分數:22

# 請輸入字串:01**++
# 總累加分數:32

# 請輸入字串:01**///
# 總累加分數:52

# 請輸入字串:AA00+-*/
# 總累加分數:36
s = input('請輸入字串: ')
cnt_num = 0
cnt_word = 0
cnt_oper_1 = 0
cnt_oper_2 = 0
for i in s:
    convert = ord(i)
    if convert >= 65 and convert <= 90:
        cnt_word += 1
    elif convert >= 48 and convert <= 57:
        cnt_num += 1
    elif convert == 43 or convert == 45:
        cnt_oper_1 += 1
    else:
        cnt_oper_2 += 1
result = cnt_num + cnt_word * 2 + cnt_oper_1 * 5 + cnt_oper_2 * 10
print('總累加分數: ', result)
# -------------------------------------------------------------------------------------
